cases/15micron_Solute_8kg_m3/system/controlDict
FoamFile
{
    version         2.0;
    format          ascii;
    class           dictionary;
    location        "system";
    object          controlDict;
}

application     aerosolEulerFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         50;

deltaT          1E-3;

writeControl    adjustableRunTime;

writeInterval   50;

purgeWrite      0;

writeFormat     binary;

writePrecision  8;

writeCompression no;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

adjustTimeStep  no;

maxCo           0.5;

maxAerosolCo    0.001;

maxDeltaT       5E-5;

libs            ("libcustomFunctions.so");

functions
{
    dcm
    {
        type            countMeanDiameter;
        libs            ("libaerosolModels.so");
        writeControl    writeTime;
    }
    CMD
    {
        type            medianDiameter;
        libs            ("libaerosolModels.so");
        writeControl    writeTime;
        p               0.0;
        result          CMD;
        
    }
        
    probes
    {
        type            probes;
        libs            ("libsampling.so");
        writeControl    timeStep;
        writeInterval   1;
        startTime       0;
        probeLocations
        (
            (0.5 0.5 0.5)
        );
        fields
        (
            "(Air|Water|NaCl).(continuous|dispersed)"
            M
            "M\.[0-9]+"
            dcm
            CMD
            rho
            T
        );
    }
}
